3B/CS343/01-Advanced-Control-Flow.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-04 Wed 17:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Advanced Control Flow</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Advanced Control Flow</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org845fdbb">1. Basics of Advanced Control Flow</a>
<ul>
<li><a href="#org373338e">1.1. Static Multi-Level Exit</a></li>
<li><a href="#org96d3164">1.2. Dynamic Memory Allocation</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org845fdbb" class="outline-2">
<h2 id="org845fdbb"><span class="section-number-2">1.</span> Basics of Advanced Control Flow</h2>
<div class="outline-text-2" id="text-1">
<p>
Within a routine, basic and advanced control structures allow any control flow.
</p>

<p>
<code>while</code> and <code>for</code> are interchangeable for predicate only loops. When using loop indexes, use <code>for</code> only.
</p>

<p>
<b>Multi-exit loops</b> have 1+ exit locations occurring within the body of the loop (such as <code>break</code>).
With multi-exit loops, exit conditions are reversed from <code>while</code> and outdented. These eliminate priming
(duplicated) code.
</p>

<p>
Multi-exit loops should not be used to simulate <code>while</code> or <code>for</code> and loop exits never need an <code>else</code> clause.
Multi-exit loops allow multiple exit conditions.
</p>

<p>
Flag variables that only affect control flow should not be used, since they are equivalent to a <code>goto</code>.
</p>
</div>
<div id="outline-container-org373338e" class="outline-3">
<h3 id="org373338e"><span class="section-number-3">1.1.</span> Static Multi-Level Exit</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>Static multi-level exit</b> exits multiple control structures where the exit point is known at compile time, done with labeled exit (<code>break</code>, <code>continue</code>).
</p>

<p>
Labeled exits helps eliminate all flag variables and can help remove duplicated code.
</p>

<p>
Normal and labeled <code>break</code> are <code>goto</code> with limitations:
</p>
<ul class="org-ul">
<li>cannot loop (only forward branch) so only loop constructs branch back</li>
<li>cannot branch into a control structure</li>
</ul>

<p>
Only use <code>goto</code> to perform static multi-level exit (simulate labeled <code>break</code> and <code>continue</code>).
</p>
</div>
</div>
<div id="outline-container-org96d3164" class="outline-3">
<h3 id="org96d3164"><span class="section-number-3">1.2.</span> Dynamic Memory Allocation</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Stack allocation preferred over heap allocation (eliminates storage-management and more efficient).
</p>

<p>
Situations where dynamic heap allocation is necessary:
</p>
<ol class="org-ol">
<li>when storage must outlive the block in which it is allocated (ownership change)</li>
<li>when the amount of data read is unknown</li>
<li>when an array of objects must be initialized via the object&rsquo;s constructor and each element has a
different value
<ol class="org-ol">
<li>use stack with <code>uArray</code> if possible (allocates without constructing and proves subscript checking)</li>
<li>calls to <code>()</code> or <code>make_unique&lt;T&gt;()</code> initialize array elements</li>
<li>allocation is \(O(1)\), so better than unique pointer and vector</li>
</ol></li>
<li>when large local variables are allocated on a small stack
<ol class="org-ol">
<li><code>uArrayPtr</code> dynamically allocates the array in heap and implicitly frees it at the end of the block
(like <code>unique_ptr</code>)</li>
<li>alternatives are large stacks (waste virtual space) or dynamic stack growth (complex and pauses)</li>
</ol></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-09-04 Wed 17:57</p>
</div>
</body>
</html>
